from Lab9_Python.MFP import MFP
# Неявно імпортується і Printer, оскільки він потрібен для MFP
# Також може знадобитися імпорт Scroller, якщо він використовується в демонстрації,
# але для цього завдання достатньо MFP.

def main():
    """
    Точка входу в програму. Демонстрація роботи класів.
    """
    
    # 1. Створення об'єкту похідного класу (Багатофункціональний пристрій)
    print("--- 1. Створення об'єкту MFP ---")
    my_mfp = MFP("Canon iR ADV C3520i", print_speed=30, has_scanner=True)
    print("---------------------------------")
    
    # 2. Використання успадкованого методу (з класу Printer)
    print("\n--- 2. Використання успадкованих методів (Друк та Додавання паперу) ---")
    my_mfp.add_paper(250)
    my_mfp.print_document(pages=5)
    print("-----------------------------------------------------------------------")

    # 3. Використання власних методів похідного класу (Сканування та Копіювання)
    print("\n--- 3. Використання власних методів MFP (Сканування та Копіювання) ---")
    my_mfp.scan_document("Важливий контракт")
    my_mfp.make_copy(pages=4, copies=2) # 4 стор * 2 копії = 8 стор
    print("---------------------------------------------------------------------")
    
    # 4. Демонстрація помилки (недостатньо паперу)
    print("\n--- 4. Демонстрація помилки ---")
    my_mfp.print_document(pages=400)
    print("-----------------------------------------------------")


if __name__ == "__main__":
    main()